---
title: WireframeBuilder
classe: Autodesk.Revit.DB.WireframeBuilder
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ShapeBuilder
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# WireframeBuilder

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void AddCurve(Curve)` | `wireframeBuilder.AddCurve(GCurve)` | Void |
| `Void AddPoint(Point)` | `wireframeBuilder.AddPoint(GPoint)` | Void |
| `Void Reset()` | `wireframeBuilder.Reset()` | Void |
| `Boolean ValidateCurve(Curve)` | `WireframeBuilder.ValidateCurve(GCurve)` | Boolean |
| `Boolean ValidatePoint(Point)` | `WireframeBuilder.ValidatePoint(GPoint)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```